#include <stdio.h>
//在C语言当中，字符串数组可以使用： char a[] [10]; 或者 char *a[]; 表示
//第一种表示方式固定了每个字符串的最大大小。第二种没有字符串的大小限制

int main() {
    char *a[3];
    a[0] = "巧克力";
    a[1]= "蛋糕";
    a[2] = "可口可乐";
    int n;
    printf("*****************************\n");
    printf("* 可选择的按键*****************\n");
    printf("* 1. 巧克力*******************\n");
    printf("* 2. 蛋糕********************\n");
    printf("* 3. 可口可乐*****************\n");
    printf("*****************************\n");


    printf("请从1-3选择按键:\n");
    scanf("%d",&n);
    printf("你选择了%s\n",a[n]);

    return 0;
}